th_cfd/pin_fine/0.orig/clad/p
/*--------------------------------*- C++ -*----------------------------------*\
| NuScale pin_clean - CLAD p (placeholder; solidThermo needs p(.,T))             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/clad";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 12.76e6;

boundaryField
{
    ".*"
    {
        type            calculated;
        value           uniform 12.76e6;
    }
}

// ************************************************************************* //
