th_cfd/pin_fine/constant/coolant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| NuScale pin_clean - COOLANT turbulence (RAS k-omega SST, all-y+ wall functions) |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/coolant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     on;
}

// ************************************************************************* //
