th_cfd/pin_fine/system/clad/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| NuScale pin_clean - CLAD (solid) fvSchemes : steady conduction only             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/clad";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes           { default steadyState; }
gradSchemes          { default Gauss linear; }
divSchemes           { default none; }
laplacianSchemes     { default Gauss linear corrected; }   // -> laplacian(alpha,h)
interpolationSchemes  { default linear; }
snGradSchemes        { default corrected; }

// ************************************************************************* //
