th_cfd/pin_fine/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| NuScale pin_clean - global fvSchemes (mesh utilities; per-region in subdirs)    |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes           { default steadyState; }
gradSchemes          { default Gauss linear; }
divSchemes           { default none; }
laplacianSchemes     { default Gauss linear corrected; }
interpolationSchemes  { default linear; }
snGradSchemes        { default corrected; }

// ************************************************************************* //
